{
  "type": "resource",
  "mode": "card",
  "title": "JavaScript",
  "description": "JavaScript is a versatile programming language used for creating interactive websites, web applications, and server-side development. It is the backbone of modern web development, allowing developers to add dynamic behavior to web pages.",
  "logo": "https://static-00.iconduck.com/assets.00/javascript-icon-256x256-8sn98o22.png",
  "roadmap": "https://roadmap.sh/javascript",
  "official": "",
  "url": "/languages/javascript",
  "items": [
    {
      "title": "JavaScript.Info",
      "description": "Modern JavaScript Tutorial: simple, but detailed explanations with examples and tasks, including: closures, document and events, object oriented programming and more.",
      "url": "https://javascript.info/"
    },
    {
      "title": "JavaScript Tutorial",
      "description": "JavaScript Tutorial provides you with many practical tutorials that help you learn JavaScript from scratch quickly and effectively.",
      "url": "https://www.javascripttutorial.net/"
    },
    {
      "title": "JavaScript - Tutorial Gateway",
      "description": "Tutorialgateway provides JavaScript tutorials with Examples and Screenshots. Please visit us to learn JavaScript Programming and Code easily.",
      "url": "https://www.tutorialgateway.org/javascript/"
    },
    {
      "title": "JavaScript - MDN",
      "description": "JavaScript is a powerful programming language that can add interactivity to a website. It was invented by Brendan Eich.",
      "url": "https://developer.mozilla.org/pt-BR/docs/Learn/JavaScript"
    },
    {
      "title": "JavaScript - Programiz",
      "description": "JavaScript is a powerful and flexible programming language. It can execute on a web browser that allows us to make interactive webpages such as popup menus, animations, form validation etc.",
      "url": "https://www.programiz.com/javascript"
    },
    {
      "title": "JavaScript - W3schools",
      "description": "Well organized and easy to understand Web building tutorials with lots of examples of how to use HTML, CSS, JavaScript, SQL, Python, PHP, Bootstrap, Java, XML and more.",
      "url": "https://www.w3schools.com/js/default.asp"
    }
  ]
}
