[
  {
      "title": "Unsplash",
      "description": "Beautiful, free images and photos that you can download and use for any project. No attribution required.",
      "url": "https://unsplash.com/"
  },
  {
      "title": "Pexels",
      "description": "Offers a wide variety of free stock photos and videos. You can browse millions of high-quality royalty-free images without any attribution.",
      "url": "https://www.pexels.com/"
  },
  {
      "title": "Pixabay",
      "description": "Provides a diverse range of media types, including photos, illustrations, and videos. All content is available for free and can be used for personal or commercial purposes.",
      "url": "https://pixabay.com/"
  },
  {
      "title": "Burst",
      "description": "Ideal for eCommerce companies, Burst offers high-quality images related to various niches. It's a great resource for website visuals.",
      "url": "https://burst.shopify.com/"
  },
  {
      "title": "New Old Stock",
      "description": "If you're looking for vintage photos, New Old Stock is the place to explore historical and nostalgic images.",
      "url": "https://nos.twnsnd.co/"
  },
  {
      "title": "123RF",
      "description": "A mix of AI-generated and stock photos. It provides a wide range of visual content for different projects.",
      "url": "https://www.123rf.com/"
  },
  {
      "title": "StockSnap",
      "description": "Curated collection of high-resolution stock photos. New images are added weekly.",
      "url": "https://stocksnap.io/"
  },
  {
      "title": "Reshot",
      "description": "Handpicked, non-stocky images for creative projects. All photos are free to use.",
      "url": "https://www.reshot.com/"
  },
  {
      "title": "SplitShire",
      "description": "Unique and artistic photos covering various themes. Great for adding a creative touch to your designs.",
      "url": "https://www.splitshire.com/"
  },
  {
      "title": "Life of Pix",
      "description": "High-resolution, free-to-use photos with no copyright restrictions. Updated regularly.",
      "url": "https://www.lifeofpix.com/"
  }
]